row_data = [
    {
        'types': [
            '首页',
            '编程语言',
            'java'
        ],
        'name': 'java基础卷(一)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'java'
        ],
        'name': 'java基础卷(二)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'java'
        ],
        'name': 'java基础卷(三)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'java'
        ],
        'name': 'java进阶卷(一)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'java'
        ],
        'name': 'java进阶卷(二)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'java'
        ],
        'name': 'java进阶卷(三)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'java'
        ],
        'name': 'java终极卷(一)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'java'
        ],
        'name': 'java终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'java'
        ],
        'name': 'java终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'java'
        ],
        'name': 'java基础卷(一)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'java'
        ],
        'name': 'java基础卷(二)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'java'
        ],
        'name': 'java基础卷(三)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'java'
        ],
        'name': 'java进阶卷(一)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'java'
        ],
        'name': 'java进阶卷(二)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'java'
        ],
        'name': 'java进阶卷(三)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'java'
        ],
        'name': 'java终极卷(一)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'java'
        ],
        'name': 'java终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'java'
        ],
        'name': 'java终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'php'
        ],
        'name': 'php基础卷(一)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'php'
        ],
        'name': 'php基础卷(二)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'php'
        ],
        'name': 'php基础卷(三)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'php'
        ],
        'name': 'php进阶卷(一)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'php'
        ],
        'name': 'php进阶卷(二)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'php'
        ],
        'name': 'php进阶卷(三)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'php'
        ],
        'name': 'php终极卷(一)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'php'
        ],
        'name': 'php终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'php'
        ],
        'name': 'php终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'c/c++'
        ],
        'name': 'c/c++基础卷(一)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'c/c++'
        ],
        'name': 'c/c++基础卷(二)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'c/c++'
        ],
        'name': 'c/c++基础卷(三)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'c/c++'
        ],
        'name': 'c/c++进阶卷(一)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'c/c++'
        ],
        'name': 'c/c++进阶卷(二)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'c/c++'
        ],
        'name': 'c/c++进阶卷(三)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'c/c++'
        ],
        'name': 'c/c++终极卷(一)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'c/c++'
        ],
        'name': 'c/c++终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'c/c++'
        ],
        'name': 'c/c++终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'c#'
        ],
        'name': 'c#基础卷(一)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'c#'
        ],
        'name': 'c#基础卷(二)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'c#'
        ],
        'name': 'c#基础卷(三)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'c#'
        ],
        'name': 'c#进阶卷(一)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'c#'
        ],
        'name': 'c#进阶卷(二)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'c#'
        ],
        'name': 'c#进阶卷(三)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'c#'
        ],
        'name': 'c#终极卷(一)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'c#'
        ],
        'name': 'c#终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '编程语言',
            'c#'
        ],
        'name': 'c#终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '算法',
            '查找'
        ],
        'name': '查找基础卷(一)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '算法',
            '查找'
        ],
        'name': '查找基础卷(二)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '算法',
            '查找'
        ],
        'name': '查找基础卷(三)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '算法',
            '查找'
        ],
        'name': '查找进阶卷(一)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '算法',
            '查找'
        ],
        'name': '查找进阶卷(二)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '算法',
            '查找'
        ],
        'name': '查找进阶卷(三)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '算法',
            '查找'
        ],
        'name': '查找终极卷(一)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '算法',
            '查找'
        ],
        'name': '查找终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '算法',
            '查找'
        ],
        'name': '查找终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '算法',
            '排序'
        ],
        'name': '排序基础卷(一)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '算法',
            '排序'
        ],
        'name': '排序基础卷(二)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '算法',
            '排序'
        ],
        'name': '排序基础卷(三)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '算法',
            '排序'
        ],
        'name': '排序进阶卷(一)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '算法',
            '排序'
        ],
        'name': '排序进阶卷(二)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '算法',
            '排序'
        ],
        'name': '排序进阶卷(三)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '算法',
            '排序'
        ],
        'name': '排序终极卷(一)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '算法',
            '排序'
        ],
        'name': '排序终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '算法',
            '排序'
        ],
        'name': '排序终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '算法',
            '复杂度'
        ],
        'name': '复杂度基础卷(一)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '算法',
            '复杂度'
        ],
        'name': '复杂度基础卷(二)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '算法',
            '复杂度'
        ],
        'name': '复杂度基础卷(三)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '算法',
            '复杂度'
        ],
        'name': '复杂度进阶卷(一)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '算法',
            '复杂度'
        ],
        'name': '复杂度进阶卷(二)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '算法',
            '复杂度'
        ],
        'name': '复杂度进阶卷(三)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '算法',
            '复杂度'
        ],
        'name': '复杂度终极卷(一)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '算法',
            '复杂度'
        ],
        'name': '复杂度终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '算法',
            '复杂度'
        ],
        'name': '复杂度终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '数组'
        ],
        'name': '数组基础卷(一)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '数组'
        ],
        'name': '数组基础卷(二)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '数组'
        ],
        'name': '数组基础卷(三)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '数组'
        ],
        'name': '数组进阶卷(一)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '数组'
        ],
        'name': '数组进阶卷(二)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '数组'
        ],
        'name': '数组进阶卷(三)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '数组'
        ],
        'name': '数组终极卷(一)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '数组'
        ],
        'name': '数组终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '数组'
        ],
        'name': '数组终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '队列'
        ],
        'name': '队列基础卷(一)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '队列'
        ],
        'name': '队列基础卷(二)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '队列'
        ],
        'name': '队列基础卷(三)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '队列'
        ],
        'name': '队列进阶卷(一)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '队列'
        ],
        'name': '队列进阶卷(二)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '队列'
        ],
        'name': '队列进阶卷(三)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '队列'
        ],
        'name': '队列终极卷(一)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '队列'
        ],
        'name': '队列终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '队列'
        ],
        'name': '队列终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '树'
        ],
        'name': '树基础卷(一)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '树'
        ],
        'name': '树基础卷(二)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '树'
        ],
        'name': '树基础卷(三)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '树'
        ],
        'name': '树进阶卷(一)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '树'
        ],
        'name': '树进阶卷(二)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '树'
        ],
        'name': '树进阶卷(三)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '树'
        ],
        'name': '树终极卷(一)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '树'
        ],
        'name': '树终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '树'
        ],
        'name': '树终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '栈'
        ],
        'name': '栈基础卷(一)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '栈'
        ],
        'name': '栈基础卷(二)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '栈'
        ],
        'name': '栈基础卷(三)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '栈'
        ],
        'name': '栈进阶卷(一)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '栈'
        ],
        'name': '栈进阶卷(二)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '栈'
        ],
        'name': '栈进阶卷(三)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '栈'
        ],
        'name': '栈终极卷(一)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '栈'
        ],
        'name': '栈终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '栈'
        ],
        'name': '栈终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '图'
        ],
        'name': '图基础卷(一)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '图'
        ],
        'name': '图基础卷(二)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '图'
        ],
        'name': '图基础卷(三)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '图'
        ],
        'name': '图进阶卷(一)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '图'
        ],
        'name': '图进阶卷(二)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '图'
        ],
        'name': '图进阶卷(三)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '图'
        ],
        'name': '图终极卷(一)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '图'
        ],
        'name': '图终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据结构',
            '图'
        ],
        'name': '图终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '网络基础'
        ],
        'name': '网络基础基础卷(一)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '网络基础'
        ],
        'name': '网络基础基础卷(二)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '网络基础'
        ],
        'name': '网络基础基础卷(三)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '网络基础'
        ],
        'name': '网络基础进阶卷(一)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '网络基础'
        ],
        'name': '网络基础进阶卷(二)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '网络基础'
        ],
        'name': '网络基础进阶卷(三)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '网络基础'
        ],
        'name': '网络基础终极卷(一)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '网络基础'
        ],
        'name': '网络基础终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '网络基础'
        ],
        'name': '网络基础终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '编程基础'
        ],
        'name': '编程基础基础卷(一)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '编程基础'
        ],
        'name': '编程基础基础卷(二)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '编程基础'
        ],
        'name': '编程基础基础卷(三)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '编程基础'
        ],
        'name': '编程基础进阶卷(一)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '编程基础'
        ],
        'name': '编程基础进阶卷(二)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '编程基础'
        ],
        'name': '编程基础进阶卷(三)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '编程基础'
        ],
        'name': '编程基础终极卷(一)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '编程基础'
        ],
        'name': '编程基础终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '编程基础'
        ],
        'name': '编程基础终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '操作系统'
        ],
        'name': '操作系统基础卷(一)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '操作系统'
        ],
        'name': '操作系统基础卷(二)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '操作系统'
        ],
        'name': '操作系统基础卷(三)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '操作系统'
        ],
        'name': '操作系统进阶卷(一)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '操作系统'
        ],
        'name': '操作系统进阶卷(二)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '操作系统'
        ],
        'name': '操作系统进阶卷(三)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '操作系统'
        ],
        'name': '操作系统终极卷(一)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '操作系统'
        ],
        'name': '操作系统终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '计算机基础',
            '操作系统'
        ],
        'name': '操作系统终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据库',
            'mysql'
        ],
        'name': 'mysql基础卷(一)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据库',
            'mysql'
        ],
        'name': 'mysql基础卷(二)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据库',
            'mysql'
        ],
        'name': 'mysql基础卷(三)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据库',
            'mysql'
        ],
        'name': 'mysql进阶卷(一)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据库',
            'mysql'
        ],
        'name': 'mysql进阶卷(二)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据库',
            'mysql'
        ],
        'name': 'mysql进阶卷(三)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据库',
            'mysql'
        ],
        'name': 'mysql终极卷(一)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据库',
            'mysql'
        ],
        'name': 'mysql终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据库',
            'mysql'
        ],
        'name': 'mysql终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据库',
            'oracle'
        ],
        'name': 'oracle基础卷(一)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据库',
            'oracle'
        ],
        'name': 'oracle基础卷(二)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据库',
            'oracle'
        ],
        'name': 'oracle基础卷(三)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据库',
            'oracle'
        ],
        'name': 'oracle进阶卷(一)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据库',
            'oracle'
        ],
        'name': 'oracle进阶卷(二)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据库',
            'oracle'
        ],
        'name': 'oracle进阶卷(三)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据库',
            'oracle'
        ],
        'name': 'oracle终极卷(一)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据库',
            'oracle'
        ],
        'name': 'oracle终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据库',
            'oracle'
        ],
        'name': 'oracle终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据库',
            'mangodb'
        ],
        'name': 'mangodb基础卷(一)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据库',
            'mangodb'
        ],
        'name': 'mangodb基础卷(二)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据库',
            'mangodb'
        ],
        'name': 'mangodb基础卷(三)',
        'num': '15',
        'level': '简单'
    },
    {
        'types': [
            '首页',
            '数据库',
            'mangodb'
        ],
        'name': 'mangodb进阶卷(一)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据库',
            'mangodb'
        ],
        'name': 'mangodb进阶卷(二)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据库',
            'mangodb'
        ],
        'name': 'mangodb进阶卷(三)',
        'num': '15',
        'level': '中等'
    },
    {
        'types': [
            '首页',
            '数据库',
            'mangodb'
        ],
        'name': 'mangodb终极卷(一)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据库',
            'mangodb'
        ],
        'name': 'mangodb终极卷(二)',
        'num': '15',
        'level': '难'
    },
    {
        'types': [
            '首页',
            '数据库',
            'mangodb'
        ],
        'name': 'mangodb终极卷(二)',
        'num': '15',
        'level': '难'
    },
]